import numpy as np

# Створюємо двовимірний масив розміром 4x4 з степенями числа 3
array_2d = np.array([[3 ** (i * 4 + j) for j in range(4)] for i in range(4)])

# Виводимо початковий масив
print("Початковий масив:")
print(array_2d)

# Замінюємо всі елементи масиву, остання цифра яких дорівнює 3, на 0
array_2d[array_2d % 10 == 3] = 0

# Виводимо масив після заміни
print("\nМасив після заміни:")
print(array_2d)

# Обчислюємо суму стовпчиків масиву
column_sums = np.sum(array_2d, axis=0)

# Виводимо суми стовпчиків
print("\nСуми стовпчиків масиву:")
print(column_sums)


